#+BEGIN_EXPORT html
---
layout: post
title: SICP Lecture 1A - Introduction
---

<script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML" type="text/javascript"></script>
#+END_EXPORT

/Modified on 2020-04-19 to add notes on scoping including block structuring code./
/Modified on 2020-07-27 to tidy the text./

#+BEGIN_QUOTE
Computer science is a terrible name for this business - first of all it's not science, it might be
engineering or it might be art ...
It's also not really very much about computers. -- Hal Abelson
#+END_QUOTE

* Example: Computing square roots

As pointed out in \S[[sec:black-boxes]] Heron of Alexandria's algorithm for computing square roots can be
expressed as finding the fixed point of a function, it is in fact an application of Newton's method
\begin{equation*}
  \begin{split}
    f \left( y_{n+1} \right) &= f \left( y_n \right) + \left. \frac{\partial f}{\partial y}
    \right|_n \Delta y = 0 \\
    \Rightarrow y_{n+1} &= y_n - \left. \frac{\partial f}{\partial y} \right|^{-1}_n f \left( y_n
    \right)
  \end{split}
\end{equation*}
to the function $f\left( y \right) = y^2 - x$.

Applying the process of procedural abstraction outlined above, Newton's method has three major
components:
1) testing whether a guess is good enough
2) if not yet good enough, compute an improved guess and
3) organise testing and updating the guess.

A simple test of whether the guess is good enough is to square it and compare with ~x~, this is
implemented in listing\nbsp[[src:good-enough]].
An improved guess is computed by subtracting the inverse gradient times the current function
evaluation from the current guess, implemented in listing\nbsp[[src:improve-guess]].

#+CAPTION: Testing whether the guess sufficiently approximates $\sqrt{x}$
#+NAME: src:good-enough
#+BEGIN_SRC scheme
  (define (good-enough? guess x)
    (< (abs (func guess x))
       0.001))
#+END_SRC

#+CAPTION: Computing an improved guess to $\sqrt{x}$ given the current guess
#+NAME: src:improve-guess
#+BEGIN_SRC scheme
  (define (grad guess)
    (* 2 guess))
  (define (improve-guess guess x)
    (- guess (/ (func guess x)
                (grad guess))))
#+END_SRC

The process of repeatedly testing and if necessary improving the guess is implemented by the
~sqrt-iter~ procedure which uses the ~if~ special form to determine which action to take based on the
current guess, recursively calling itself with an improved guess if not sufficiently close to the
solution.
Finally the ~sqrt~ function pulls this all together, using ~1.0~ as an initial guess[fn:1].
Note that in the above the function evaluation has been abstracted as the ~func~ procedure also
defined here.

#+CAPTION: Defining the ~sqrt~ procedure
#+NAME: src:sqrt
#+BEGIN_SRC scheme :noweb strip-export :padline no
  <<src:square>>
  (define (func guess x)
    (- (square guess) x))
  <<src:good-enough>>
  <<src:improve-guess>>
  (define (sqrt-iter guess x)
    (if (good-enough? guess x)
        guess
        (sqrt-iter (improve-guess guess x) x)))

  (define (sqrt x)
    (sqrt-iter 1.0 x))
#+END_SRC

#+RESULTS: src:sqrt
: #<unspecified>

Applying ~sqrt~ to some numbers whose square root is known yields
#+BEGIN_SRC scheme :noweb strip-export :exports both
  <<src:sqrt>>
  (sqrt 4)
#+END_SRC
and
#+BEGIN_SRC scheme :noweb strip-export :exports both
  <<src:sqrt>>
  (sqrt 2)
#+END_SRC
which should be close to expected values (note that ~good-enough?~ is relatively crude).

